[
  {
    "path": "posts/2021-02-13-dataviz-makeover-02/",
    "title": "DataViz Makeover 02",
    "description": "Objective: To create an alternative visualisation to understand the willingness of the public on Covid-19 vaccination. The data used was obtained from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github (https://github.com/YouGov-Data/covid-19-tracker). The research mainly utilised survey conducted on January 2021.",
    "author": [
      {
        "name": "Angeline Jiang",
        "url": "www.linkedin.com/in/angeline-jiang"
      }
    ],
    "date": "2021-02-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critiques and Suggestions for Current Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2.0 Proposed Design\r\n3.0 Data Visualisation Steps\r\n3.1 Data Preparation\r\n3.2 Tableau Works\r\n3.2.1 Import dataset and create additional variables.\r\n3.2.2 Create Gantt Chart\r\n3.2.3 Create Proportion Chart\r\n3.2.4 Create Dashboard\r\n\r\n\r\n4.0 Final Data Visualisation Output\r\nData Visualisation Link (Tableau Online):\r\n4.1 Major Insights\r\nObservation 1:\r\nObservation 2:\r\nObservation 3:\r\n\r\n\r\n\r\n1.0 Critiques and Suggestions for Current Visualisation\r\n\r\n\r\n\r\n1.1 Clarity\r\n\r\n\r\nS.N\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n1\r\n\r\n\r\nThe left bar chart is showing the responses received from the question “If a Covid-19 vaccine were made available to me this week, I would definitely get it.” and not “Which country is more pro-vaccine?” The title confuses readers as readers may be expecting a country rather than “1 - Strongly agree” to “5 - Strongly disagree”.\r\n\r\n\r\nUse a more appropriate title for the chart e.g. “Willingness of people to get vaccinated if a vaccine is made available to him/her this week.”\r\n\r\n\r\n2\r\n\r\n\r\nThere’s no notes to define what is considered as “pro-vaccine”. Will responds of “1 – Strongly agree” and “2” be considered as “pro-vaccine” or only a responds of “1 - Strongly agree” be considered as “pro-vaccine”? Or will “3” also be considered as “pro-vaccine”?\r\n\r\n\r\nInclude a note to indicate what “pro-vaccine” refers to, or to use the same colour (but different tone) for responses classified as “pro-vaccine”.\r\n\r\n\r\n3\r\n\r\n\r\nThe chart did not show the confidence interval of the proportion.\r\n\r\n\r\nCompute the confidence interval and include in the chart.\r\n\r\n\r\n4\r\n\r\n\r\nThe scaling of the bar charts are different, the bars on the right chart is longer than the bars on the left chart for the same %.\r\n\r\n\r\nAmend the scale of the x-axis such that both charts shows same scaling/size, if bar charts are used for both charts.\r\n\r\n\r\n1.2 Aesthetics\r\n\r\n\r\nS.N\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n5\r\n\r\n\r\nThe colour of categories are all different, which makes it difficult to relate the closeness of e.g. “1 - Strongly agree” and “2”.\r\n\r\n\r\nUse same colour, but different tone for similar responses. E.g. Dark green for “1 - Strongly agree” and light green for “2”.\r\n\r\n\r\n6\r\n\r\n\r\nNaming of the country should be Caps for the first alphabet.\r\n\r\n\r\nCaps the first name of the country.\r\n\r\n\r\n7\r\n\r\n\r\nSpelling mistake in the word “vaccine”.\r\n\r\n\r\nCheck the spelling of the word, should be “Vaccine”.\r\n\r\n\r\n8\r\n\r\n\r\nNot clear what “Vac 1” refers to.\r\n\r\n\r\nUse better title of the chart to reflect what the legends refer to. Alternatively, include a note to explain what “Vac 1” means.\r\n\r\n\r\n9\r\n\r\n\r\nGood use of sorting on the right chart as it clearly shows the top countries that had higher proportion of people who strongly agreed to vaccination. The left bar chart is sorted by alphabetical order which made it difficult to see the top countries that had higher proportion of “pro-vaccine”, will be better if can sort by % of “Strongly agreed” (similar to the bar chart on the right) instead.\r\n\r\n\r\nEnsure that the charts have the same sorting order for ease of reading/referencing.\r\n\r\n\r\n10\r\n\r\n\r\nDid not indicate the source of the data.\r\n\r\n\r\nInclude the source at the bottom of the charts.\r\n\r\n\r\n2.0 Proposed Design\r\n\r\n\r\n\r\n\r\n\r\nS.N\r\n\r\n\r\nAdvantages\r\n\r\n\r\n1\r\n\r\n\r\nIncludes survey findings on other questions instead of just on “Vac 1” so that users can have a broader view on the sentiments of respondents. In addition, it shows the exact question asked in the survey for users to see.\r\n\r\n\r\n2\r\n\r\n\r\nFor easy reading, suggest that the colour of sentiment scores follow a theme i.e. blue theme for agree, red for disagree and grey for neutral.\r\n\r\n\r\n3\r\n\r\n\r\nAdditional filters such as Age, Gender, Household size, number of children in household and employment status will be included as additional features for deeper analysis by users.\r\n\r\n\r\n4\r\n\r\n\r\nUse different type of charts to represent the sentiments i.e. Gantt chart and Proportion chart. For the proportion chart, confidence interval are also included to understand if there are significant difference between the proportions.\r\n\r\n\r\n5\r\n\r\n\r\nIncludes option for users to select between 95% and 99% confidence interval, depending on their use case.\r\n\r\n\r\n6\r\n\r\n\r\nUsers have the option to choose which sentiment (i.e. strongly agree/ agree/ neutral/ disagree/ strongly disagree) proportion chart they would like to see, instead of only giving users the option of seeing the strongly agree chart.\r\n\r\n\r\n7\r\n\r\n\r\nThe “Sort by” filter allows users to sort the Gantt chart according to their preference. For example, users may want to know among the questions, which had the highest disagreement view.\r\n\r\n\r\n8\r\n\r\n\r\nSource of data is indicated and users can easily know where the data is from and download it.\r\n\r\n\r\n3.0 Data Visualisation Steps\r\n3.1 Data Preparation\r\nAs the datasets consist of many variables and for this makeover, we are only using selective variables, hence follow Steps 1 to 6 to keep only those variables (reduce the size of the dataset for importing into Tableau later) and save out the dataset which will be used in the visualisation.\r\nStep 1: Open a new Tableau window, click on ‘Text file’ and navigate to the data file. Select the first country file e.g. “australia.csv”.\r\n\r\n\r\n\r\nStep 2: Right click “australia.csv” in the pane and select “Remove” as shown below.\r\n\r\n\r\n\r\nStep 3: Click and drag “New Union” into the pane as shown below.\r\n\r\n\r\n\r\nStep 4: Select and drag all the country.csv files into the “Union” pop-up window and click “OK”.\r\n\r\n\r\n\r\nStep 5: Open a new Tableau worksheet and drag “Country”, “vac_1”, “vac2_1”, “vac2_2”, vac2_3”, “vac2_6”, “vac_3”, “gender”, “age”, “household_size”, “household_children”, “employment_status” to “Columns” and “RecordNo” to Rows. Right click “RecordNo” and change to “Count”.\r\n\r\n\r\n\r\nStep 6: Save out the dataset by clicking on “Analysis” tab, select “View Data” and thereafter select “Export All”. Save the dataset as “vaccine” to a folder.\r\n\r\n\r\n\r\n3.2 Tableau Works\r\n3.2.1 Import dataset and create additional variables.\r\nStep 1: Open a new Tableau window, click on “Text file” and open the “vaccine.csv” file save out earlier (Step 6 of 3.1).\r\n\r\n\r\n\r\nStep 2: Select the highlighted variables, click on the drop down list and select “Pivot”.\r\n\r\n\r\n\r\nStep 3: Right click the drop down list and select “Aliases”. Edit the “Value (Alias)” column to as shown below and click “OK”.\r\n\r\n\r\n\r\nStep 4: Rename the columns to as shown below.\r\n\r\n\r\n\r\nStep 5: Split the column “Table Name” by clicking on the drop down list and select “Split”. Rename the new column as “Country”.\r\n\r\n\r\n\r\nStep 6: Click on the drop down list for “Country” and select “Aliases” and rename the countries to reflect Upper case for the first alphabet of the country name.\r\n\r\n\r\n\r\nStep 7: Click on the drop down list for “Score” and select “Aliases” and rename the values as shown below.\r\n\r\n\r\n\r\nStep 8: Click on the drop down list for “Score” and select “Create Calculated Field”. Input the following formula into the pop-up window.\r\n\r\n\r\n\r\nStep 9: Click on the drop down list for “No. of Records” and select “Create Calculated Field”. Input the following formula into the pop-up window.\r\n\r\n\r\n\r\nStep 10: Click on the drop down list for “ Age” and select “Create Group”. Create the groups as shown below.\r\n\r\n\r\n\r\nStep 11: Click on the drop down list for “ Household Size” and select “Create Group”. Create the groups as shown below.\r\n\r\n\r\n\r\nStep 12: Click on the drop down list for “ Household Children” and select “Create Group”. Create the groups as shown below.\r\n\r\n\r\n\r\nStep 13: Click on the drop down list for “ Employment Status” and select “Create Group”. Create the groups as shown below.\r\n\r\n\r\n\r\n3.2.2 Create Gantt Chart\r\nStep 1: Open a new Tableau workbook. Create calculated field “Total Count” by clicking on “Analysis” on the ribbon tab and select “Create Calculated Field”. Input the formula shown below.\r\n\r\n\r\n\r\nStep 2: Create more calculated fields. Click on “Analysis” on the ribbon tab and select “Create Calculated Field”, input the formula shown below. Repeat the steps to create the other calculated fields shown below.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nStep 3: Drag “Gantt Percent” into “Columns”, “Country” into “Rows” and “Score” into the colours Marks card as shown below.\r\n\r\n\r\n\r\nStep 4: Click on “Gantt Percent”, click on “Compute Using” and select “Score”.\r\n\r\n\r\n\r\nStep 5: Under the Marks card, drag “Percentage” into the “Size” and “Score” into “Detail”. Select “Gantt Bar” from the drop down list.\r\n\r\n\r\n\r\nStep 6: In the “Score” card, click on “NA” and select “Exclude”.\r\n\r\n\r\n\r\nStep 7: Shift the sequence of the Score to reflect the following.\r\n\r\n\r\n\r\nStep 8: Double click on the yellow box and change the colour to as shown below.\r\n\r\n\r\n\r\nStep 9: Drag these variables (in red boxes) into “Filters” as shown below.\r\n\r\n\r\n\r\nStep 10: Click the drop down list and select “Show Filter”. Repeat to show all the filters.\r\n\r\n\r\n\r\nStep 11: To create a sorting option in the visualisation, click on the drop down list, and select “Create Parameter”. Input the values as shown below.\r\n\r\n\r\n\r\nStep 12: Click on “Analysis” on the ribbon tab and select “Create Calculated Field”, input the formula shown below.\r\n\r\n\r\n\r\nStep 13: Click “Country”, select “Sort”. Select the options as shown below.\r\n\r\n\r\n\r\nStep 14: In the Marks card, click on “Tooltip”. Remove the first line from the tooltip (in red box).\r\n\r\n\r\n\r\n3.2.3 Create Proportion Chart\r\nStep 1: Create more calculated fields. Click on “Analysis” on the ribbon tab and select “Create Calculated Field”, input the formula shown below. Repeat the steps to create the other calculated fields shown below.\r\n\r\n\r\n\r\nStep 2: To create a dynamic visualisation of the proportion chart (choose which sentiment to filter and at which Confidence interval), click on the drop down list, and select “Create Parameter”. Input the values as shown below.\r\n\r\n\r\n\r\nStep 3: Create more calculated fields. Click on “Analysis” on the ribbon tab and select “Create Calculated Field”, input the formula shown below. Repeat the steps to create the other calculated fields shown below.\r\n\r\n\r\n\r\nStep 4: Drag “Choose_Prop” into “Columns”.\r\n\r\n\r\n\r\nStep 5: Pull “measure value” to the top of the chart (along the top of x-axis). In the Measure Values card, keep only “AGG(Choose Lower Limit)” and “AGG(Choose Upper Limit)”.\r\n\r\n\r\n\r\nStep 6: Click on the x-axis and select “Synchronize Axis”.\r\n\r\n\r\n\r\nStep 7: In the Marks card, change “Measure value” to “Line”.\r\n\r\n\r\n\r\nStep 8: Drag “Measure Names” to “Path”.\r\n\r\n\r\n\r\nStep 9: Remove “Measure Names” from “Detail”.\r\n\r\n\r\n\r\nStep 10: Change the sequence of “AGG(Choose_Prop)” and “Measure Values”, to look like below.\r\n\r\n\r\n\r\nStep 11: Show parameters by clicking on the parameters and select “Show Parameter”. Do the same for all the parameters.\r\n\r\n\r\n\r\nStep 12: To synchronize the colour of the proportion chart with the Gantt chart, drag “Choose Prop” into the Colour Marks card under “AGG(Choose Prop)” as shown below.\r\n\r\n\r\n\r\nStep 13: In the “Choose Prop” paramter, select “Strongly Agree_Prop”. Click on “Colour”, Click on the colour box and input the colour code as shown. Repeat the same steps to sync the colours for “Agree_Prop”, “Neutral_Prop”, “Disagree_Prop” and “Strongly Disagree_Prop” as shown below.\r\n\r\n\r\n\r\nStep 14: Drag “Choose Prop” into the Colour Marks card under “Measure Values”.\r\n\r\n\r\n\r\nStep 15: Click on the header and unselect “Show Header” to hide the header.\r\n\r\n\r\n\r\nStep 16: Rename the axis by clicking on the axis and select “Edit Axis”. Change the Axis Title to “Proportion Percent”.\r\n\r\n\r\n\r\nStep 17: Add annotation by clicking on the chart, select “Annotate” and “Area”. In the pop-up window, click “Insert” and select “Parameters.Choose Prop”. Shift the annotation area to be just slightly above the x-axis as shown below.\r\n\r\n\r\n\r\n3.2.4 Create Dashboard\r\nStep 1: Open a new Dashboard tab, drag the worksheet into the pane.\r\n\r\n\r\n\r\nStep 2: Drag “Text” to above the chart and input the title for the chart as shown.\r\n\r\n\r\n\r\nStep 3: Click “Assessment Item” and drag it to be above the chart.\r\n\r\n\r\n\r\nStep 4: Drag “Text” to above the chart and input the data source as shown.\r\n\r\n\r\n\r\nStep 5: Click and shift the filters such that it shows the following layout.\r\n\r\n\r\n\r\n4.0 Final Data Visualisation Output\r\nData Visualisation Link (Tableau Online):\r\nhttps://public.tableau.com/views/DataVizMakeoverSentimentsonCovid-19vaccination/Dashboard1?:language=en&:display_count=y&publish=yes&:origin=viz_share_link\r\n\r\n\r\n\r\n4.1 Major Insights\r\nObservation 1:\r\nCompared to other countries, Spain (Green box) had the highest proportion of respondents saying that they strongly agreed that they are worried about getting Covid-19. Netherlands (Orange box) had the lowest proportion of strongly agreed.\r\nHowever, when comes to the question on whether they will regret not getting vaccinated when vaccine is available, Spain had lower proportion of respondents saying that they strongly agreed that they will regret compared to Netherlands.\r\n\r\n\r\n\r\nObservation 2:\r\nDenmark (Green box) had the highest proportion of respondents who strongly agreed that they believe their government will provide them with effective Covid-19 vaccine, which also translates to lower proportion of respondents who strongly agreed that they’re worried about the side-effects of the vaccine.\r\nHowever, this is unlike Canada (Orange box) which ranked among the top few countries with high proportion of respondents who strongly agreed that they believe their government will provide them with effective Covid-19 vaccine, yet, Canada is also among the top few countries where high proportion of respondents strongly agreed that they’re worried about the side-effects of the vaccine.\r\n\r\n\r\n\r\nObservation 3:\r\nAlthough a high proportion of respondents in Japan strongly agreed that they’re worried about getting Covid-19, a low proportion of them strongly agreed that they will go for vaccination when the vaccine is made available to them either this week or a year from now.\r\n\r\n\r\n\r\nHope you enjoyed reading :)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-02T02:08:33+08:00",
    "input_file": "dataviz-makeover-02.utf8.md"
  },
  {
    "path": "posts/2021-01-25-dataviz-makeover-01/",
    "title": "DataViz Makeover 01",
    "description": "Objective: To create an alternative visualisation to understand Singapore's labour force in 2019. The original visualisation can be found in chart 6 of the report \"Labour Force in Singapore 2019\". (https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx)",
    "author": [
      {
        "name": "Angeline Jiang",
        "url": "www.linkedin.com/in/angeline-jiang"
      }
    ],
    "date": "2021-01-25",
    "categories": [],
    "contents": "\r\n1.0 Critiques and Suggestions for Current Visualisation\r\n\r\n\r\n\r\n1.1 Clarity\r\n\r\n\r\nS.N\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n1\r\n\r\n\r\nAge bands in the chart/table is not reflective of the age bands used in the analysis/key message.\r\nFor example, to obtain the share of residents aged 55 & over in the labour force, readers must manually sum the four columns “55-59”, “60-64”, “65-69” and “70 & over”.\r\n\r\n\r\nUse 3 age bands: “15-24”, “25-54” and “55 & over”\r\n\r\n\r\n2\r\n\r\n\r\nAge bands (x-axis) are categorical variables, and line graph is not appropriate as it is more suitable for continuous variable.\r\nNo grid line, hence difficult to map the value in the table to the point on the line.\r\n\r\n\r\nBar chart will be more appropriate for categorical variable, include labels beside bar for ease of reading.\r\n\r\n\r\n3\r\n\r\n\r\nThe chart’s x-axis is in bands (categorical data), but the vertical dotted line (median age) is a numeric/continuous data.\r\nBy including the vertical line, readers may mis-interpret that the intercept is the share of residents in the labour force at a particular age.\r\n\r\n\r\nCreate another chart for median age trend line.\r\n\r\n\r\n4\r\n\r\n\r\nData on labour force participation rate (LFPR) by age is not available in the chart/table.\r\nNote: LFPR at the overall level (without age breakdown) is available in para 1.4 (Chart 4 of the report)\r\n\r\n\r\nInclude a chart on LFPR by age\r\n\r\n\r\n5\r\n\r\n\r\nAnalysis is only on the snapshot of 2009 (10 years ago) and 2019. Missed out on what happened in between.\r\n\r\n\r\nInclude analysis on the snapshot of 2014 (5 years ago).\r\n\r\n\r\n1.2 Aesthetics\r\n\r\n\r\nS.N\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n6\r\n\r\n\r\nThe word “June” is labelled multiple (6) times on the chart.\r\n\r\n\r\nAs the reference period for the Comprehensive Labour Force Survey is always as at June, suggest to amend the note at the bottom of the chart to “Data for each year are for June periods, and may not add up to 100% due to rounding.”\r\n\r\n\r\n7\r\n\r\n\r\nThe colour tone of the chart’s background is very closer to the tone of the 2009 line, which makes it difficult to read the trend.\r\nResolution of the chart is also very poor, making it even more difficult to read the trends and figures in the table.\r\n\r\n\r\nIncrease the transparency of the background colour and use a different colour from the background. Higher resolution image should be attached in the report instead.\r\n\r\n\r\n8\r\n\r\n\r\nThe vertical dotted lines (reference line) are too thin and makes it difficult to differentiate the colour between the two lines.\r\n\r\n\r\nWeight of the reference lines (if any) should be heavier/more\r\n\r\n\r\n9\r\n\r\n\r\nNo annotation on the charts and hence readers may not notice any interesting findings.\r\n\r\n\r\nInclude annotation in the chart to bring out interesting findings.\r\n\r\n\r\n2.0 Proposed Design\r\n\r\n\r\n\r\n\r\n\r\nS.N\r\n\r\n\r\nAdvantages\r\n\r\n\r\n1\r\n\r\n\r\nReduce the number of age groups to focus on the 3 main broad groups for better focus and easier to related back to the analysis.\r\n\r\n\r\n2\r\n\r\n\r\nBar chart instead of line graph since age bands are categorical.\r\nBy showing only 2019 data, readers can have a quick sense of the 2019 labour market (it’s a 2019 labour market report).\r\n\r\n\r\n3\r\n\r\n\r\nLabels are next to the bars, hence readers do not need to look around the chart or the table for the value.\r\n\r\n\r\n4\r\n\r\n\r\nIncluded a chart for participation rate by age and median age so that readers can better relate the analysis with the charts.\r\n\r\n\r\n5\r\n\r\n\r\nInstead of showing charts on shares/participation rate for 2009 and 2014, it will be helpful to show the change in percentage points since 2009 and 2014 respectively as readers do not need to compute the change mentally. The 2014 data also provides readers additional view of the recent 5 years.\r\n\r\n\r\n6\r\n\r\n\r\nRemove “June” label from the title of the charts and include additional notes at the bottom.\r\n\r\n\r\n7\r\n\r\n\r\nWhite background for better contrast with the charts presented.\r\n\r\n\r\n8\r\n\r\n\r\nBy having separate colours for positive and negative values, readers can easily know if the change is positive or negative.\r\n\r\n\r\n3.0 Data Visualisation Steps\r\n3.1 Data Preparation\r\n3.1.1 Resident Labour Force dataset\r\nStep 1: Download “Table (7) Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 – 2019 (June)” from https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx.\r\n\r\n\r\n\r\nStep 2: Format the excel. Unmerge the cells and remove unnecessary rows/columns. Unmerge row 5, rename column D as “Age” and delete columns A-C, F, H, J, L, N, P, R, T, V, X and Z (i.e. empty columns). Delete rows 1-4, 6 and 19. Rename the columns to include “(old)” and save the excel file.\r\n\r\n\r\n\r\nStep 3: Open Tableau and connect to the excel file saved out in Step 2.\r\n\r\n\r\n\r\nA view of the table in Tableau\r\n\r\n\r\n\r\nStep 4: Pivot the table and rename the columns to “Year” and “Counts”.\r\n\r\n\r\n\r\nStep 5: Right click on the drop down list under “Age” column, click “Create Group” to create 3 groups “15 - 24”, “25 - 54” and “55 & over” by highlighting the subgroups and clicking on the “Group” button. Rename the group and repeat for the other 2 groups.\r\n\r\n\r\n\r\nStep 6: Open a new worksheet in Tableau and drag “Age (group)” to Columns, “Year” to Rows and “Counts” to “Text” in the marks card. To obtain the row total, click on “Analysis” and drag “Totals” to “Rows Grand Totals”.\r\n\r\n\r\n\r\nStep 7: To obtain the share (%), click on “Sum(Counts)” in the marks card, and click on “Quick Table Calculations” and select “Percent of Total”\r\n\r\n\r\n\r\nStep 8: Save this table for using in the visualisation by clicking on “Analysis” at the ribbon bar, select “View Data”, followed by “Export All” and save into a folder.\r\n\r\n\r\n\r\n3.1.2 Resident Labour Force Participation Rate dataset\r\nStep 1: Download Labour Force Participation rate dataset from Singstat Table Builder (https://www.tablebuilder.singstat.gov.sg/publicfacing/mainMenu.action) by following the illustration below\r\n\r\n\r\n\r\nStep 2: Open the excel file and copy the “outside labour force” table to the top right as shown below. Rename the years “In” and “Out” to reflect the counts for in and out of labour force. Delete rows 1-5, 7, 19 onward and rename column A to “Age”. Save the Excel file.\r\n\r\n\r\n\r\nA view of the final table in Excel\r\n\r\n\r\n\r\nStep 3: Open Tableau window and import the Excel saved in Step 2.\r\n\r\n\r\n\r\nStep 4: Right click on the drop down list under “Age” column, click “Create Group” to create 3 groups “15 - 24”, “25 - 54” and “55 & over” by highlighting the subgroups and clicking on the “Group” button. Rename the group and repeat for the other 2 groups.\r\n\r\n\r\n\r\nStep 5: To obtain the labour force participation counts by the newly created age bands, click to open a new Tableau workbook. Drag “Measure Names” to “Columns”, “Age (group)” to “Rows”, and “Measure Values” to the Text marks card as shown below.\r\n\r\n\r\n\r\nStep 6: Save this table by clicking on “Analysis” at the ribbon bar, select “View Data”, followed by “Export All” and save into a folder.\r\n\r\n\r\n\r\nStep 7: Drag the csv file saved in Step 6 into the polaris, right click the drop down list for the column “Year_In/Out” and click on Split. Rename the new columns “Year” and “In/Out”.\r\n\r\n\r\n\r\nStep 8: Open a new Tableau workbook, drag “In/Out” into “Columns”, “Age (group)” and “Year” into “Rows” and “Counts” into the Text marks card. Click on “Analysis” and drag “Total” into “Row Grand Totals”.\r\n\r\n\r\n\r\nStep 9: To compute participation rate (%), click on the “Analysis” ribbon and select “Percentage of” and click “Row in Pane”.\r\n\r\n\r\n\r\nStep 10: Save this table by clicking on “Analysis” at the ribbon bar, select “View Data”, followed by “Export All” and save into a folder.\r\n\r\n\r\n\r\nStep 11: Open the csv file saved in step 10. To get the labour force participation rate, filter the column “In/Out” and delete rows that are “Out” (“In” refers to individuals in the labour force while “Out” refers to individuals not in the labour force). Save the file.\r\n\r\n\r\n\r\n3.1.3 Median Age of Labour Force\r\nStep 1: Download “Table (2) Key Characteristics of Resident Labour Force, 2009 – 2019 (June)” from https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx.\r\n\r\n\r\n\r\nStep 2: Keep only columns B and G, delete rows 1-6 and 18 onward. Insert one row in row 1 and label “Year” and “Median Age”, to obtain the table below. Save the excel.\r\n\r\n\r\n\r\n3.2 Tableau Works\r\n3.2.1 Importing and transforming data for creation of visualisation\r\nStep 1: Import csv file for shares of resident labour force saved in 3.1.1 (step 8).\r\n\r\n\r\n\r\nStep 2: Remove the old dataset and drag in the share file. Delete the first two columns, and rename last column to “Share”.\r\n\r\n\r\n\r\nStep 3: To obtain shares in %, click on the drop down under “Share” column and select “Create Calculated Field”. Type the formula shown below and click “OK”. Rename the new column as “Shares (%)”.\r\n\r\n\r\n\r\nStep 4: Import participation rate csv file saved in 3.1.2 (step 11) by adding a connection.\r\n\r\n\r\n\r\nStep 5: Drag in the participation rate file to create a union with the labour force share file and edit the relationship as shown below.\r\n\r\n\r\n\r\nStep 6: To obtain the participation rate in %, click on the drop down and create a calculated field as shown below.\r\n\r\n\r\n\r\nStep 7: For both data in step 6 and 3, change the data type for “Year” to date as shown below.\r\n\r\n\r\n\r\nStep 8: Add new data source to import median age data obtained from 3.1.3 (step 2). Similar to step 7, change the data type for “Year” to date.\r\n\r\n\r\n\r\n3.2.2 Creation of charts to show shares of resident labour force\r\nDo steps 1 - 5 to create visualisation for 2019 labour force data, and steps 6 - 8 for comparison with 2009 and 2014.\r\nStep 1: Open a new Tableau worksheet. Drag “Shares (%)” to “Columns”, “Age (group)” to “Rows” and “Year” to filter marks card. In the filter, select “Year”, then “Next” and check the box for 2019.\r\n\r\n\r\n\r\nStep 2: Drag “Shares (%)” to the text marks card, click the green pill, select “format” to format the labeling of the bars.\r\n\r\n\r\n\r\nStep 3: (To do formatting of the chart e.g. remove the grid lines etc) Click on the x-axis and select “format” and select “None” for the Grid lines under “Sheet”, “Columns” and “Rows”.\r\n\r\n\r\n\r\nStep 4: Click on the x-asix and un-tick “Show Header”.\r\n\r\n\r\n\r\nStep 5: Click on colour in the marks card and select the colour for the bar.\r\n\r\n\r\n\r\nStep 6: Go to “Data Source” sheet and create 2 calculated fields as shown below.\r\n\r\n\r\n\r\nStep 7: Create another 2 calculated fields to obtain the change in percentage points since 2009 and 2014.\r\n\r\n\r\n\r\nStep 8: Open a new Tableau worksheet. Drag “Percentage Change wrt 2009” and “Percentage Change wrt 2014” into “Columns” and “Age (group)” into Rows\" as shown below. Ensure that “Bar” is being selected at the marks card. Drag “Percentage Change wrt 2009” and “Percentage Change wrt 2014” into their respective Text marks card for the label to appear and format the label to show in “pp” (similar to step 2). Ensure that the range for both charts are the sam by clicking on the x-axis, then click “Edit axis”. Click on the x-axis and y-axis and un-tick “Show Header” to hide the axis. Drag “Percentage Change wrt 2009” and “Percentage Change wrt 2014” into colour marks card to format the colour of the bar as shown below.\r\n\r\n\r\n\r\n3.2.3 Creation of Charts to show participation rate\r\nRepeat the steps in 3.2.2 (steps 1 - 5) to create visualisation for 2019 participation rate, and the steps in 3.2.2 (steps 6 - 8) for comparison with 2009 and 2014.\r\nStep 1 - 5: Repeat the steps in 3.2.2 (steps 1 - 5) for participation rate data and the final visualisation is as below\r\n\r\n\r\n\r\nStep 6 - 7: Repeat the steps in 3.2.2 (steps 6 - 7) with the following formula\r\n\r\n\r\n\r\nStep 8: Repeat the steps in 3.2.2 (step 8) and the final visualisation is as below\r\n\r\n\r\n\r\n3.2.4 Creation of Charts to show median age trend\r\nStep 1: Open a new Tableau worksheet and select data source “Median Age”. Drag “Year” into “Columns”, “Median Age” into “Rows” and Text marks card to obtain the following chart (ensure to select Line in the marks card)\r\n\r\n\r\n\r\n4.0 Final Data Visualisation Output\r\nData Visualisation Link (Tableau Online):\r\nhttps://public.tableau.com/views/DataVizMakeoverSingaporesResidentLabourForcein2019/FinalDashboard?:language=en&:display_count=y&:origin=viz_share_link\r\n\r\n\r\n\r\nMajor Insights\r\n\r\n\r\nS.N\r\n\r\n\r\nInsights\r\n\r\n\r\n1\r\n\r\n\r\nShare of older residents (aged 55 & over) in the labour force rose by 9pp compared to a decade ago to 25%, while share of residents aged 25 - 54 declined by 8pp.\r\n\r\n\r\n2\r\n\r\n\r\nDespite a decline in labour force share, labour force participation rate of aged 25 - 54 rose by 4pp compared to a decade ago to 88%.\r\n\r\n\r\n3\r\n\r\n\r\nShare of residents in the labour force by age and participation rate by age were relatively stable over the last 5 years (2014 - 2019).\r\n\r\n\r\n4\r\n\r\n\r\nMedian Age of residents in the labour force increased from 41 years old in 2009 to 44 years old in 2019. Nonetheless, the median age remained at 43 years old from 2014 to 2018 before increasing to 44 years old in 2019.\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T00:22:30+08:00",
    "input_file": "dataviz-makeover-01.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Angeline Jiang",
        "url": "www.linkedin.com/in/angeline-jiang"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T23:46:06+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Angeline Jiang",
        "url": "www.linkedin.com/in/angeline-jiang"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-05T20:27:12+08:00",
    "input_file": "my-first-post.utf8.md"
  }
]
